; domain
(define (domain p1)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    arm
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (is-injured ?person - person)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (person-need ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (has-crate-drone-arm ?arm - arm ?crate - crate)
    (empty-arm ?arm - arm)
)

(:action pick-up-crate
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?arm - arm
    )
    :precondition (and 
        (empty-arm ?arm)                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)           
    )
    :effect (and
        (has-crate-drone-arm ?arm ?crate)     
        (not (empty-arm ?arm))           
        (not (crate-at ?crate ?location))     
    )
)

(:action drone-move
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
    )
    :precondition (and 
        (drone-at ?drone ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from)) 
        (drone-at ?drone ?location_to)         
    )
)

(:action drop-crate
    :parameters (
        ?location - location
        ?person - person
        ?crate - crate
        ?arm - arm
        ?content - content
        ?drone - drone
    )
    :precondition (and 
        (person-at ?person ?location)     
        (drone-at ?drone ?location)       
        (has-crate-drone-arm ?arm ?crate)     
        (content-crate ?content ?crate)       
        (person-need ?person ?content)    
    )
    :effect (and 
        (not (has-crate-drone-arm ?arm ?crate))   
        (has-content-person ?person ?content) 
        (empty-arm ?arm)                      
)
)
)

; problem
(define (problem drone_problem_d1_r0_l35_p35_c35_g35_ct2)
(:domain p1)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	loc28 - location
	loc29 - location
	loc30 - location
	loc31 - location
	loc32 - location
	loc33 - location
	loc34 - location
	loc35 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	crate27 - crate
	crate28 - crate
	crate29 - crate
	crate30 - crate
	crate31 - crate
	crate32 - crate
	crate33 - crate
	crate34 - crate
	crate35 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	person28 - person
	person29 - person
	person30 - person
	person31 - person
	person32 - person
	person33 - person
	person34 - person
	person35 - person
	left right - arm
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(crate-at crate14 depot)
	(crate-at crate15 depot)
	(crate-at crate16 depot)
	(crate-at crate17 depot)
	(crate-at crate18 depot)
	(crate-at crate19 depot)
	(crate-at crate20 depot)
	(crate-at crate21 depot)
	(crate-at crate22 depot)
	(crate-at crate23 depot)
	(crate-at crate24 depot)
	(crate-at crate25 depot)
	(crate-at crate26 depot)
	(crate-at crate27 depot)
	(crate-at crate28 depot)
	(crate-at crate29 depot)
	(crate-at crate30 depot)
	(crate-at crate31 depot)
	(crate-at crate32 depot)
	(crate-at crate33 depot)
	(crate-at crate34 depot)
	(crate-at crate35 depot)
	(empty-arm left)
	(empty-arm right)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate food crate7)
	(content-crate food crate8)
	(content-crate food crate9)
	(content-crate food crate10)
	(content-crate food crate11)
	(content-crate food crate12)
	(content-crate food crate13)
	(content-crate food crate14)
	(content-crate food crate15)
	(content-crate food crate16)
	(content-crate food crate17)
	(content-crate food crate18)
	(content-crate food crate19)
	(content-crate food crate20)
	(content-crate food crate21)
	(content-crate medicine crate22)
	(content-crate medicine crate23)
	(content-crate medicine crate24)
	(content-crate medicine crate25)
	(content-crate medicine crate26)
	(content-crate medicine crate27)
	(content-crate medicine crate28)
	(content-crate medicine crate29)
	(content-crate medicine crate30)
	(content-crate medicine crate31)
	(content-crate medicine crate32)
	(content-crate medicine crate33)
	(content-crate medicine crate34)
	(content-crate medicine crate35)
	(person-at person1 loc3)
	(person-at person2 loc9)
	(person-at person3 loc33)
	(person-at person4 loc15)
	(person-at person5 loc9)
	(person-at person6 loc20)
	(person-at person7 loc32)
	(person-at person8 loc10)
	(person-at person9 loc16)
	(person-at person10 loc14)
	(person-at person11 loc13)
	(person-at person12 loc32)
	(person-at person13 loc21)
	(person-at person14 loc6)
	(person-at person15 loc1)
	(person-at person16 loc20)
	(person-at person17 loc16)
	(person-at person18 loc12)
	(person-at person19 loc32)
	(person-at person20 loc29)
	(person-at person21 loc1)
	(person-at person22 loc17)
	(person-at person23 loc18)
	(person-at person24 loc10)
	(person-at person25 loc7)
	(person-at person26 loc22)
	(person-at person27 loc20)
	(person-at person28 loc19)
	(person-at person29 loc2)
	(person-at person30 loc12)
	(person-at person31 loc20)
	(person-at person32 loc14)
	(person-at person33 loc15)
	(person-at person34 loc31)
	(person-at person35 loc27)
	(person-need person2 food)
	(person-need person3 food)
	(person-need person4 medicine)
	(person-need person5 food)
	(person-need person5 medicine)
	(person-need person6 food)
	(person-need person7 food)
	(person-need person8 food)
	(person-need person8 medicine)
	(person-need person10 food)
	(person-need person10 medicine)
	(person-need person11 food)
	(person-need person12 food)
	(person-need person12 medicine)
	(person-need person13 food)
	(person-need person13 medicine)
	(person-need person14 food)
	(person-need person15 medicine)
	(person-need person19 medicine)
	(person-need person20 food)
	(person-need person21 food)
	(person-need person22 medicine)
	(person-need person23 food)
	(person-need person23 medicine)
	(person-need person24 food)
	(person-need person24 medicine)
	(person-need person25 food)
	(person-need person26 food)
	(person-need person27 food)
	(person-need person28 medicine)
	(person-need person29 food)
	(person-need person30 food)
	(person-need person33 medicine)
	(person-need person34 food)
	(person-need person35 medicine)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person2 food)
	(has-content-person person3 food)
	(has-content-person person4 medicine)
	(has-content-person person5 food)
	(has-content-person person5 medicine)
	(has-content-person person6 food)
	(has-content-person person7 food)
	(has-content-person person8 food)
	(has-content-person person8 medicine)
	(has-content-person person10 food)
	(has-content-person person10 medicine)
	(has-content-person person11 food)
	(has-content-person person12 food)
	(has-content-person person12 medicine)
	(has-content-person person13 food)
	(has-content-person person13 medicine)
	(has-content-person person14 food)
	(has-content-person person15 medicine)
	(has-content-person person19 medicine)
	(has-content-person person20 food)
	(has-content-person person21 food)
	(has-content-person person22 medicine)
	(has-content-person person23 food)
	(has-content-person person23 medicine)
	(has-content-person person24 food)
	(has-content-person person24 medicine)
	(has-content-person person25 food)
	(has-content-person person26 food)
	(has-content-person person27 food)
	(has-content-person person28 medicine)
	(has-content-person person29 food)
	(has-content-person person30 food)
	(has-content-person person33 medicine)
	(has-content-person person34 food)
	(has-content-person person35 medicine)
))
)

; plan
1. (pick-up-crate crate35 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate35 depot)
   added: (has-crate-drone-arm right crate35)
   goals met: 1 of 36
2. (pick-up-crate crate21 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate21 depot)
   added: (has-crate-drone-arm left crate21)
   goals met: 1 of 36
3. (drone-move depot loc33 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc33)
   goals met: 0 of 36
4. (drop-crate loc33 person3 crate21 left food drone1)
   deleted: (has-crate-drone-arm left crate21)
   added: (has-content-person person3 food) (empty-arm left)
   goals met: 1 of 36
5. (drone-move loc33 depot drone1)
   deleted: (drone-at drone1 loc33)
   added: (drone-at drone1 depot)
   goals met: 2 of 36
6. (pick-up-crate crate20 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate20 depot)
   added: (has-crate-drone-arm left crate20)
   goals met: 2 of 36
7. (drone-move depot loc31 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc31)
   goals met: 1 of 36
8. (drop-crate loc31 person34 crate20 left food drone1)
   deleted: (has-crate-drone-arm left crate20)
   added: (has-content-person person34 food) (empty-arm left)
   goals met: 2 of 36
9. (drone-move loc31 depot drone1)
   deleted: (drone-at drone1 loc31)
   added: (drone-at drone1 depot)
   goals met: 3 of 36
10. (pick-up-crate crate19 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate19 depot)
   added: (has-crate-drone-arm left crate19)
   goals met: 3 of 36
11. (drone-move depot loc29 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc29)
   goals met: 2 of 36
12. (drop-crate loc29 person20 crate19 left food drone1)
   deleted: (has-crate-drone-arm left crate19)
   added: (has-content-person person20 food) (empty-arm left)
   goals met: 3 of 36
13. (drone-move loc29 depot drone1)
   deleted: (drone-at drone1 loc29)
   added: (drone-at drone1 depot)
   goals met: 4 of 36
14. (pick-up-crate crate18 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate18 depot)
   added: (has-crate-drone-arm left crate18)
   goals met: 4 of 36
15. (drone-move depot loc27 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc27)
   goals met: 3 of 36
16. (drop-crate loc27 person35 crate35 right medicine drone1)
   deleted: (has-crate-drone-arm right crate35)
   added: (has-content-person person35 medicine) (empty-arm right)
   goals met: 4 of 36
17. (drone-move loc27 depot drone1)
   deleted: (drone-at drone1 loc27)
   added: (drone-at drone1 depot)
   goals met: 5 of 36
18. (pick-up-crate crate34 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate34 depot)
   added: (has-crate-drone-arm right crate34)
   goals met: 5 of 36
19. (drone-move depot loc22 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc22)
   goals met: 4 of 36
20. (drop-crate loc22 person26 crate18 left food drone1)
   deleted: (has-crate-drone-arm left crate18)
   added: (has-content-person person26 food) (empty-arm left)
   goals met: 5 of 36
21. (drone-move loc22 depot drone1)
   deleted: (drone-at drone1 loc22)
   added: (drone-at drone1 depot)
   goals met: 6 of 36
22. (pick-up-crate crate17 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate17 depot)
   added: (has-crate-drone-arm left crate17)
   goals met: 6 of 36
23. (drone-move depot loc19 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc19)
   goals met: 5 of 36
24. (drop-crate loc19 person28 crate34 right medicine drone1)
   deleted: (has-crate-drone-arm right crate34)
   added: (has-content-person person28 medicine) (empty-arm right)
   goals met: 6 of 36
25. (drone-move loc19 depot drone1)
   deleted: (drone-at drone1 loc19)
   added: (drone-at drone1 depot)
   goals met: 7 of 36
26. (pick-up-crate crate33 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate33 depot)
   added: (has-crate-drone-arm right crate33)
   goals met: 7 of 36
27. (drone-move depot loc17 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc17)
   goals met: 6 of 36
28. (drop-crate loc17 person22 crate33 right medicine drone1)
   deleted: (has-crate-drone-arm right crate33)
   added: (has-content-person person22 medicine) (empty-arm right)
   goals met: 7 of 36
29. (drone-move loc17 depot drone1)
   deleted: (drone-at drone1 loc17)
   added: (drone-at drone1 depot)
   goals met: 8 of 36
30. (pick-up-crate crate32 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate32 depot)
   added: (has-crate-drone-arm right crate32)
   goals met: 8 of 36
31. (drone-move depot loc13 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc13)
   goals met: 7 of 36
32. (drop-crate loc13 person11 crate17 left food drone1)
   deleted: (has-crate-drone-arm left crate17)
   added: (has-content-person person11 food) (empty-arm left)
   goals met: 8 of 36
33. (drone-move loc13 depot drone1)
   deleted: (drone-at drone1 loc13)
   added: (drone-at drone1 depot)
   goals met: 9 of 36
34. (pick-up-crate crate16 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate16 depot)
   added: (has-crate-drone-arm left crate16)
   goals met: 9 of 36
35. (drone-move depot loc12 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc12)
   goals met: 8 of 36
36. (drop-crate loc12 person30 crate16 left food drone1)
   deleted: (has-crate-drone-arm left crate16)
   added: (has-content-person person30 food) (empty-arm left)
   goals met: 9 of 36
37. (drone-move loc12 depot drone1)
   deleted: (drone-at drone1 loc12)
   added: (drone-at drone1 depot)
   goals met: 10 of 36
38. (pick-up-crate crate15 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate15 depot)
   added: (has-crate-drone-arm left crate15)
   goals met: 10 of 36
39. (drone-move depot loc7 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc7)
   goals met: 9 of 36
40. (drop-crate loc7 person25 crate15 left food drone1)
   deleted: (has-crate-drone-arm left crate15)
   added: (has-content-person person25 food) (empty-arm left)
   goals met: 10 of 36
41. (drone-move loc7 depot drone1)
   deleted: (drone-at drone1 loc7)
   added: (drone-at drone1 depot)
   goals met: 11 of 36
42. (pick-up-crate crate14 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate14 depot)
   added: (has-crate-drone-arm left crate14)
   goals met: 11 of 36
43. (drone-move depot loc6 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc6)
   goals met: 10 of 36
44. (drop-crate loc6 person14 crate14 left food drone1)
   deleted: (has-crate-drone-arm left crate14)
   added: (has-content-person person14 food) (empty-arm left)
   goals met: 11 of 36
45. (drone-move loc6 depot drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 depot)
   goals met: 12 of 36
46. (pick-up-crate crate13 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate13 depot)
   added: (has-crate-drone-arm left crate13)
   goals met: 12 of 36
47. (drone-move depot loc2 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc2)
   goals met: 11 of 36
48. (drop-crate loc2 person29 crate13 left food drone1)
   deleted: (has-crate-drone-arm left crate13)
   added: (has-content-person person29 food) (empty-arm left)
   goals met: 12 of 36
49. (drone-move loc2 depot drone1)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 depot)
   goals met: 13 of 36
50. (pick-up-crate crate12 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate12 depot)
   added: (has-crate-drone-arm left crate12)
   goals met: 13 of 36
51. (drone-move depot loc32 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc32)
   goals met: 12 of 36
52. (drop-crate loc32 person7 crate12 left food drone1)
   deleted: (has-crate-drone-arm left crate12)
   added: (has-content-person person7 food) (empty-arm left)
   goals met: 13 of 36
53. (drone-move loc32 depot drone1)
   deleted: (drone-at drone1 loc32)
   added: (drone-at drone1 depot)
   goals met: 14 of 36
54. (pick-up-crate crate11 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate11 depot)
   added: (has-crate-drone-arm left crate11)
   goals met: 14 of 36
55. (drone-move depot loc32 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc32)
   goals met: 13 of 36
56. (drop-crate loc32 person12 crate11 left food drone1)
   deleted: (has-crate-drone-arm left crate11)
   added: (has-content-person person12 food) (empty-arm left)
   goals met: 14 of 36
57. (drone-move loc32 depot drone1)
   deleted: (drone-at drone1 loc32)
   added: (drone-at drone1 depot)
   goals met: 15 of 36
58. (pick-up-crate crate10 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate10 depot)
   added: (has-crate-drone-arm left crate10)
   goals met: 15 of 36
59. (drone-move depot loc32 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc32)
   goals met: 14 of 36
60. (drop-crate loc32 person12 crate32 right medicine drone1)
   deleted: (has-crate-drone-arm right crate32)
   added: (has-content-person person12 medicine) (empty-arm right)
   goals met: 15 of 36
61. (drone-move loc32 depot drone1)
   deleted: (drone-at drone1 loc32)
   added: (drone-at drone1 depot)
   goals met: 16 of 36
62. (pick-up-crate crate31 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate31 depot)
   added: (has-crate-drone-arm right crate31)
   goals met: 16 of 36
63. (drone-move depot loc32 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc32)
   goals met: 15 of 36
64. (drop-crate loc32 person19 crate31 right medicine drone1)
   deleted: (has-crate-drone-arm right crate31)
   added: (has-content-person person19 medicine) (empty-arm right)
   goals met: 16 of 36
65. (drone-move loc32 depot drone1)
   deleted: (drone-at drone1 loc32)
   added: (drone-at drone1 depot)
   goals met: 17 of 36
66. (pick-up-crate crate30 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate30 depot)
   added: (has-crate-drone-arm right crate30)
   goals met: 17 of 36
67. (drone-move depot loc21 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc21)
   goals met: 16 of 36
68. (drop-crate loc21 person13 crate10 left food drone1)
   deleted: (has-crate-drone-arm left crate10)
   added: (has-content-person person13 food) (empty-arm left)
   goals met: 17 of 36
69. (drop-crate loc21 person13 crate30 right medicine drone1)
   deleted: (has-crate-drone-arm right crate30)
   added: (has-content-person person13 medicine) (empty-arm right)
   goals met: 18 of 36
70. (drone-move loc21 depot drone1)
   deleted: (drone-at drone1 loc21)
   added: (drone-at drone1 depot)
   goals met: 19 of 36
71. (pick-up-crate crate29 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate29 depot)
   added: (has-crate-drone-arm right crate29)
   goals met: 19 of 36
72. (pick-up-crate crate9 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate9 depot)
   added: (has-crate-drone-arm left crate9)
   goals met: 19 of 36
73. (drone-move depot loc20 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc20)
   goals met: 18 of 36
74. (drop-crate loc20 person6 crate9 left food drone1)
   deleted: (has-crate-drone-arm left crate9)
   added: (has-content-person person6 food) (empty-arm left)
   goals met: 19 of 36
75. (drone-move loc20 depot drone1)
   deleted: (drone-at drone1 loc20)
   added: (drone-at drone1 depot)
   goals met: 20 of 36
76. (pick-up-crate crate8 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate8 depot)
   added: (has-crate-drone-arm left crate8)
   goals met: 20 of 36
77. (drone-move depot loc20 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc20)
   goals met: 19 of 36
78. (drop-crate loc20 person27 crate8 left food drone1)
   deleted: (has-crate-drone-arm left crate8)
   added: (has-content-person person27 food) (empty-arm left)
   goals met: 20 of 36
79. (drone-move loc20 depot drone1)
   deleted: (drone-at drone1 loc20)
   added: (drone-at drone1 depot)
   goals met: 21 of 36
80. (pick-up-crate crate7 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate7 depot)
   added: (has-crate-drone-arm left crate7)
   goals met: 21 of 36
81. (drone-move depot loc18 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc18)
   goals met: 20 of 36
82. (drop-crate loc18 person23 crate7 left food drone1)
   deleted: (has-crate-drone-arm left crate7)
   added: (has-content-person person23 food) (empty-arm left)
   goals met: 21 of 36
83. (drop-crate loc18 person23 crate29 right medicine drone1)
   deleted: (has-crate-drone-arm right crate29)
   added: (has-content-person person23 medicine) (empty-arm right)
   goals met: 22 of 36
84. (drone-move loc18 depot drone1)
   deleted: (drone-at drone1 loc18)
   added: (drone-at drone1 depot)
   goals met: 23 of 36
85. (pick-up-crate crate28 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate28 depot)
   added: (has-crate-drone-arm right crate28)
   goals met: 23 of 36
86. (pick-up-crate crate6 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate6 depot)
   added: (has-crate-drone-arm left crate6)
   goals met: 23 of 36
87. (drone-move depot loc15 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc15)
   goals met: 22 of 36
88. (drop-crate loc15 person4 crate28 right medicine drone1)
   deleted: (has-crate-drone-arm right crate28)
   added: (has-content-person person4 medicine) (empty-arm right)
   goals met: 23 of 36
89. (drone-move loc15 depot drone1)
   deleted: (drone-at drone1 loc15)
   added: (drone-at drone1 depot)
   goals met: 24 of 36
90. (pick-up-crate crate27 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate27 depot)
   added: (has-crate-drone-arm right crate27)
   goals met: 24 of 36
91. (drone-move depot loc15 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc15)
   goals met: 23 of 36
92. (drop-crate loc15 person33 crate27 right medicine drone1)
   deleted: (has-crate-drone-arm right crate27)
   added: (has-content-person person33 medicine) (empty-arm right)
   goals met: 24 of 36
93. (drone-move loc15 depot drone1)
   deleted: (drone-at drone1 loc15)
   added: (drone-at drone1 depot)
   goals met: 25 of 36
94. (pick-up-crate crate26 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate26 depot)
   added: (has-crate-drone-arm right crate26)
   goals met: 25 of 36
95. (drone-move depot loc14 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc14)
   goals met: 24 of 36
96. (drop-crate loc14 person10 crate6 left food drone1)
   deleted: (has-crate-drone-arm left crate6)
   added: (has-content-person person10 food) (empty-arm left)
   goals met: 25 of 36
97. (drop-crate loc14 person10 crate26 right medicine drone1)
   deleted: (has-crate-drone-arm right crate26)
   added: (has-content-person person10 medicine) (empty-arm right)
   goals met: 26 of 36
98. (drone-move loc14 depot drone1)
   deleted: (drone-at drone1 loc14)
   added: (drone-at drone1 depot)
   goals met: 27 of 36
99. (pick-up-crate crate25 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate25 depot)
   added: (has-crate-drone-arm right crate25)
   goals met: 27 of 36
100. (pick-up-crate crate5 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate5 depot)
   added: (has-crate-drone-arm left crate5)
   goals met: 27 of 36
101. (drone-move depot loc10 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc10)
   goals met: 26 of 36
102. (drop-crate loc10 person8 crate5 left food drone1)
   deleted: (has-crate-drone-arm left crate5)
   added: (has-content-person person8 food) (empty-arm left)
   goals met: 27 of 36
103. (drone-move loc10 depot drone1)
   deleted: (drone-at drone1 loc10)
   added: (drone-at drone1 depot)
   goals met: 28 of 36
104. (pick-up-crate crate4 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate4 depot)
   added: (has-crate-drone-arm left crate4)
   goals met: 28 of 36
105. (drone-move depot loc10 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc10)
   goals met: 27 of 36
106. (drop-crate loc10 person8 crate25 right medicine drone1)
   deleted: (has-crate-drone-arm right crate25)
   added: (has-content-person person8 medicine) (empty-arm right)
   goals met: 28 of 36
107. (drone-move loc10 depot drone1)
   deleted: (drone-at drone1 loc10)
   added: (drone-at drone1 depot)
   goals met: 29 of 36
108. (pick-up-crate crate24 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate24 depot)
   added: (has-crate-drone-arm right crate24)
   goals met: 29 of 36
109. (drone-move depot loc10 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc10)
   goals met: 28 of 36
110. (drop-crate loc10 person24 crate4 left food drone1)
   deleted: (has-crate-drone-arm left crate4)
   added: (has-content-person person24 food) (empty-arm left)
   goals met: 29 of 36
111. (drop-crate loc10 person24 crate24 right medicine drone1)
   deleted: (has-crate-drone-arm right crate24)
   added: (has-content-person person24 medicine) (empty-arm right)
   goals met: 30 of 36
112. (drone-move loc10 depot drone1)
   deleted: (drone-at drone1 loc10)
   added: (drone-at drone1 depot)
   goals met: 31 of 36
113. (pick-up-crate crate23 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate23 depot)
   added: (has-crate-drone-arm right crate23)
   goals met: 31 of 36
114. (pick-up-crate crate3 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate3 depot)
   added: (has-crate-drone-arm left crate3)
   goals met: 31 of 36
115. (drone-move depot loc9 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc9)
   goals met: 30 of 36
116. (drop-crate loc9 person2 crate3 left food drone1)
   deleted: (has-crate-drone-arm left crate3)
   added: (has-content-person person2 food) (empty-arm left)
   goals met: 31 of 36
117. (drone-move loc9 depot drone1)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 depot)
   goals met: 32 of 36
118. (pick-up-crate crate2 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate2 depot)
   added: (has-crate-drone-arm left crate2)
   goals met: 32 of 36
119. (drone-move depot loc9 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc9)
   goals met: 31 of 36
120. (drop-crate loc9 person5 crate2 left food drone1)
   deleted: (has-crate-drone-arm left crate2)
   added: (has-content-person person5 food) (empty-arm left)
   goals met: 32 of 36
121. (drop-crate loc9 person5 crate23 right medicine drone1)
   deleted: (has-crate-drone-arm right crate23)
   added: (has-content-person person5 medicine) (empty-arm right)
   goals met: 33 of 36
122. (drone-move loc9 depot drone1)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 depot)
   goals met: 34 of 36
123. (pick-up-crate crate22 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate22 depot)
   added: (has-crate-drone-arm right crate22)
   goals met: 34 of 36
124. (pick-up-crate crate1 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate1 depot)
   added: (has-crate-drone-arm left crate1)
   goals met: 34 of 36
125. (drone-move depot loc1 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc1)
   goals met: 33 of 36
126. (drop-crate loc1 person15 crate22 right medicine drone1)
   deleted: (has-crate-drone-arm right crate22)
   added: (has-content-person person15 medicine) (empty-arm right)
   goals met: 34 of 36
127. (drop-crate loc1 person21 crate1 left food drone1)
   deleted: (has-crate-drone-arm left crate1)
   added: (has-content-person person21 food) (empty-arm left)
   goals met: 35 of 36
128. (drone-move loc1 depot drone1)
   deleted: (drone-at drone1 loc1)
   added: (drone-at drone1 depot)
   goals met: 36 of 36
